all/.local/bin/app-health
#!/usr/bin/env bash
# Health

# [[file:../../../app.org::*Health][Health:1]]
# ~/DotCortex/all/.local/bin/app-health
set -euo pipefail

MAN="$HOME/DotCortex/all/.app/manifest/apps.ssv"
APP_ONLY="${APP_ONLY:-}"

if [ ! -f "$MAN" ]; then
  echo "No app manifest at $MAN"
  exit 0
fi

_emit_norm() {
  awk -v FS='[ \t]+' '
    function dequote(s){ return (s=="\"\"" ? "" : s) }
    $0 ~ /^[[:space:]]*#/ || NF==0 { next }
    {
      n1=$1; n2=$2; n3=$3; n4=$4; n5=$5; n6=$6; n7=$7; n8=$8;
      printf "%s|%s|%s|%s|%s|%s|%s|%s\n",
        dequote(n1),dequote(n2),dequote(n3),dequote(n4),
        dequote(n5),dequote(n6),dequote(n7),dequote(n8)
    }
  ' "$MAN"
}

echo "== app health =="

while IFS='|' read -r name method url root bindir linkmode note r1
do
  [ -n "$name" ] || continue
  [ -n "$APP_ONLY" ] && [ "$name" != "$APP_ONLY" ] && continue

  # Expand root, derive defaults to mirror app-apply
  if [ -z "$root" ]; then
    root="$HOME/.local/${name}.app"
  elif [ "${root:0:1}" = "~" ]; then
    root="${root/#\~/$HOME}"
  fi

  [ -z "$bindir" ] && bindir="bin"
  bin_path="${root%/}/$bindir"

  if command -v "$name" >/dev/null 2>&1; then
    echo "[$name] in PATH at $(command -v "$name")"
  elif [ -x "$bin_path/$name" ]; then
    echo "[$name] installed at $bin_path/$name but not in PATH"
  elif [ -d "$root" ]; then
    echo "[$name] app root present at $root but binary '$name' not found in $bin_path"
  else
    echo "[$name] not found (no PATH entry, no app root at $root)"
  fi

done < <(_emit_norm)
# Health:1 ends here
